#+LATEX_HEADER: \usepackage{graphicx}

**** Convolution Example
- Is a linear operator which makes it both associative and commutative.  Does not matter which sequence if flipped or shifted.
  - F(n) = [0,1,2] and g(n) = [1 1 1 1]
  - Flip F(n) $\rightarrow$ [2,1,0]
  - line up so that the last element of F overlaps the first element of g
  - Process the data $H(n) = \sum_{k = 0}^{5} F(k) g(n-k)$
  - Sum up wherever there is an overlap of numbers
  - Keep shifting to the right by 1 for each iteration

  \begin{array} {lllllll}
  2 & 1 & 0 &   &   &   & \\
    &   & 1 & 1 & 1 & 1 &
  \end{array}
    - H(0) = 1* 0 = 0

    \begin{array} {lllllll}
      & 2 & 1 & 0 &   &   & \rightarrow by 1 \\
      &   & 1 & 1 & 1 & 1 &
    \end{array}
    - H(1) = (0 * 1) + (1 * 1) = 1

    \begin{array} {lllllll}
      &   & 2 & 1 & 0 &   & \\
      &   & 1 & 1 & 1 & 1 &
    \end{array}
    - H(2) =  (0 * 1) + (1 * 1) + (2 * 1) = 3

    \begin{array} {lllllll}
      &   &   & 2 & 1 & 0  & \\
      &   & 1 & 1 & 1 & 1 &
    \end{array}
    - H(3) = (0 * 1) + (1 * 1) + (2 * 1) = 3

    \begin{array} {lllllll}
      &   &   &   & 2 & 1 & \\
      &   & 1 & 1 & 1 & 1 &
    \end{array}
    - H(4) = (2 * 1) + (1 * 1) = 3

    \begin{array} {lllllll}
      &   &   &   &   & 2 & \\
      &   & 1 & 1 & 1 & 1 &
    \end{array}
    - H(5) = 2 * 1 = 2
    - H(n) = [0 1 3 3 3 2]
#+begin_src octave :session
f = [0 1 2 ]
g = [1 1 1 1]
h = conv(f, g)
#+end_src

#+RESULTS:
#+begin_example

f =

   0   1   2
g =

   1   1   1   1
h =

   0   1   3   3   3   2
#+end_example

